---
kind: other
id: Properties.T:Autodesk.Revit.DB.Analysis.SystemsAnalysisOptions
source: html/f99bd484-4042-4ff8-2ee6-588d7965a736.htm
---
# SystemsAnalysisOptions Properties

Specifies whether the .NET object represents a valid Revit entity.